# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [2]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [3]:
url = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv'
baby_names = pd.read_csv(url, sep=',')

### Step 4. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
baby_names = baby_names.loc[:, 'Name':'Count']
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names['Gender'].value_counts()

Gender
F    558846
M    457549
Name: count, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [ ]:
del baby_names['Year']

In [26]:
names = baby_names.groupby('Name')['Count'].sum().reset_index()
names

          Name  Count
0        Aaban     12
1        Aadan     23
2      Aadarsh      5
3        Aaden   3426
4       Aadhav      6
...        ...    ...
17627     Zyra     42
17628    Zyrah     11
17629    Zyren      6
17630    Zyria     59
17631   Zyriah     58

[17632 rows x 2 columns]

### Step 8. How many different names exist in the dataset?

In [31]:
names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [50]:
names.iloc[names.Count.idxmax(), :]

Name      Jacob
Count    242874
Name: 7198, dtype: object

In [51]:
names[names.Count==names.Count.max()]

       Name   Count
7198  Jacob  242874

### Step 10. How many different names have the least occurrences?

In [56]:
len(names[names.Count==names.Count.min()])

2578

### Step 11. What is the median name occurrence?

In [61]:
names.Count.median()
names[names.Count == 49]

          Name  Count
524    Aishani     49
637      Alara     49
986     Alysse     49
1083     Ameir     49
1360     Anely     49
...        ...    ...
15403   Sriram     49
16250  Trinton     49
16622     Vita     49
17119     Yoni     49
17570  Zuleima     49

[66 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [62]:
names.Count.std()

11006.06946789057

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [64]:
names.Count.describe().to_frame()

               Count
count   17632.000000
mean     2008.932169
std     11006.069468
min         5.000000
25%        11.000000
50%        49.000000
75%       337.000000
max    242874.000000